[Quartermaster X2SoldierClassTemplate]
+DisplayName="Quartermaster"
+ClassSummary="Quartermasters are an excellent combat medic with a limited promotion tree but offer extreme versatility once the training center is built allowing them to bring additional consumables to missions or partake in other training."
+LeftAbilityTreeTitle="Packrat"
+RightAbilityTreeTitle="Supply Carrier"
AbilityTreeTitles[0]="Quartermaster"
AbilityTreeTitles[1]="Medic"
AbilityTreeTitles[2]="Fighter"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"
AbilityTreeTitles[5]="Supply"
AbilityTreeTitles[6]="Demand"
AbilityTreeTitles[7]="Stock"

+RandomNickNames[0]="Packrat"
+RandomNickNames[1]="Carrier"
+RandomNickNames[2]="Hoarder"
+RandomNickNames[3]="Boss"
+RandomNickNames[4]="Officer"
+RandomNickNames[5]="Comrade"

[PR_Quartermaster X2SoldierClassTemplate]
+DisplayName="Quartermaster"
+ClassSummary="Quartermasters excel in close range combat, keeping the squad alive, or being able to carry a lot of grenades into battle. They gain an additional 8 AP per level."
+LeftAbilityTreeTitle="Packrat"
+RightAbilityTreeTitle="Supply Carrier"
AbilityTreeTitles[0]="Quartermaster"
AbilityTreeTitles[1]="Medic"
AbilityTreeTitles[2]="Fighter"
AbilityTreeTitles[3]="Demolition"
AbilityTreeTitles[4]="Drill Sergeant"
AbilityTreeTitles[5]="Surgery"
AbilityTreeTitles[6]="Pistols"

+RandomNickNames[0]="Packrat"
+RandomNickNames[1]="Carrier"
+RandomNickNames[2]="Hoarder"
+RandomNickNames[3]="Boss"
+RandomNickNames[4]="Officer"
+RandomNickNames[5]="Comrade"
